app/Views/pages/cari.php

                  if ($a['id_user'] == $id_user) {
                    $allowed = true;
                  } else {
                    $cek = $db->table('tbl_arsip_akses')
                      ->where('id_arsip', $a['id_arsip'])
                      ->groupStart()
                      ->groupStart()
                      ->where('tipe_akses', 'departemen')
                      ->where('id_dep', $id_dep)
                      ->groupEnd()
                      ->orGroupStart()
                      ->where('tipe_akses', 'user')
                      ->where('id_user', $id_user)
                      ->groupEnd()
                      ->groupEnd()
                      ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip_akses`
WHERE `id_arsip` = '176'
AND   (
   (
`tipe_akses` = 'departemen'
AND `id_dep` = 27
  )
OR    (
`tipe_akses` = 'user'
AND `id_user` = 42
  )
 )