app/Controllers/BaseController.php

SELECT *
FROM `tbl_dep`
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.
        $this->depModel = new Model_departemen();
        // E.g.: $this->session = service('session');
        $departemen = $this->depModel->findAll();