app/Controllers/Departemen.php

SELECT *
FROM `tbl_dep`
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen Departemen',
            'departemen' => $this->depModel->findAll(),