app/Controllers/Home.php

    public function index(): string
    {
        $session = session();
        $userId  = (int) $session->get('id_user');
        $depId   = (int) $session->get('id_dep');
        $level   = (int) $session->get('level');

        $user = $this->Model_user->find($userId);
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id_user` = 18

    private function superAdminDashboard(): string
    {
        $kategoriData    = $this->Model_arsip->getCountByKategori();
        $departemenChart = $this->Model_arsip->getCountPerDepartment();

        $tot_size     = $this->Model_arsip->getTotalSize();
        $tot_size_int = (int) ($tot_size ?? 0);

        $data = [
            'title'           => 'Dashboard Superadmin',
            'tot_arsip'       => $this->Model_home->tot_arsip(),
            'tot_dep'         => $this->Model_home->tot_dep(),
            'tot_kategori'    => $this->Model_home->tot_kategori(),
            'tot_user'        => $this->Model_home->tot_user(),
            'tot_Rahasia'     => $this->Model_arsip->where('klasifikasi', 'Rahasia')->countAllResults(),
            'tot_terbatas'    => $this->Model_arsip->where('klasifikasi', 'terbatas')->countAllResults(),
            'tot_Umum'        => $this->Model_arsip->where('klasifikasi', 'Umum')->countAllResults(),
            'tot_size'        => formatSize($tot_size_int),
            'lastActivity'    => $this->Model_audit->getLastActivity(5),
            'kategoriChart'   => $kategoriData,
            'departemenChart' => $departemenChart,
            'jumlahUser'      => $this->Model_user->countAllResults(),
            'jumlahFile'      => $this->Model_arsip->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip`
WHERE `klasifikasi` = 'Rahasia'
SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip`
WHERE `klasifikasi` = 'terbatas'
SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip`
WHERE `klasifikasi` = 'Umum'
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip`

    private function adminDashboard(int $depId, int $level): string
    {
        $totalArsip   = $this->Model_arsip->countByDepartment($depId);
        $totalUser    = $this->Model_user->countByDepartment($depId);

        // ambil kategori chart per departemen
        $kategoriChart = $this->Model_arsip->getCountKategoriByDepId($depId);

        $lastActivity = $this->Model_audit->getActivityByDepartment($depId, 10);

        $deptInfo = $this->Model_departemen->find($depId);
        $quickDept = [[
            'nama_dep'   => $deptInfo['nama_dep'] ?? 'Departemen',
            'total_arsip' => $totalArsip,
            'total_user' => $totalUser
        ]];

        $data = [
            'title'         => 'Dashboard Admin Departemen',
            'level'         => $level,
            'tot_Rahasia'   => $this->Model_arsip->where(['id_dep' => $depId, 'klasifikasi' => 'Rahasia'])->countAllResults(),
            'tot_terbatas'  => $this->Model_arsip->where(['id_dep' => $depId, 'klasifikasi' => 'terbatas'])->countAllResults(),
            'tot_Umum'      => $this->Model_arsip->where(['id_dep' => $depId, 'klasifikasi' => 'Umum'])->countAllResults(),
            'kategoriChart' => $kategoriChart,
            'quickDept'     => $quickDept,
            'totalArsip'    => $totalArsip,
            'totalUser'     => $totalUser,
            'lastActivity'  => $lastActivity
        ];
---
SELECT *
FROM `tbl_dep`
WHERE `tbl_dep`.`id_dep` = 27
SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip`
WHERE `id_dep` = 27
AND `klasifikasi` = 'Rahasia'
SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip`
WHERE `id_dep` = 27
AND `klasifikasi` = 'terbatas'
SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip`
WHERE `id_dep` = 27
AND `klasifikasi` = 'Umum'