app/Controllers/Kategori.php

SELECT *
FROM `tbl_dep`
---
    public function index(): string
    {
        $id_dep = session()->get('id_dep');
        $level  = session()->get('level');

        $isSuper = ($level == 0);

        $kategoriTree = $this->Model_kategori->getKategoriTreeOptimized($isSuper ? null : $id_dep);
        $kategoriList = $this->Model_kategori->getKategoriWithParent($isSuper ? null : $id_dep);
        $departemen   = $isSuper ? $this->Model_departemen->findAll() : [];