app/Models/Model_audit.php

    public function getLastActivity($limit = 10)
        {
            return $this->select('tbl_audit_trail.*, tbl_dep.nama_dep')
                        ->join('tbl_user', 'tbl_user.id_user = tbl_audit_trail.id_user', 'left')
                        ->join('tbl_dep', 'tbl_dep.id_dep = tbl_user.id_dep', 'left')
                        ->orderBy('created_at', 'DESC')
                        ->limit($limit)
                        ->findAll();
---
SELECT `tbl_audit_trail`.*, `tbl_dep`.`nama_dep`
FROM `tbl_audit_trail`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_audit_trail`.`id_user`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_user`.`id_dep`
ORDER BY `created_at` DESC
 LIMIT 5

    public function getActivityByDepartment($depId, $limit = 10)
{
    return $this->select('tbl_audit_trail.*, tbl_user.username, tbl_dep.nama_dep')
                ->join('tbl_user', 'tbl_user.id_user = tbl_audit_trail.id_user', 'left')
                ->join('tbl_dep', 'tbl_dep.id_dep = tbl_user.id_dep', 'left')
                ->where('tbl_user.id_dep', $depId)
                ->orderBy('tbl_audit_trail.created_at', 'DESC')
                ->limit($limit)
                ->findAll();
---
SELECT `tbl_audit_trail`.*, `tbl_user`.`username`, `tbl_dep`.`nama_dep`
FROM `tbl_audit_trail`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_audit_trail`.`id_user`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_user`.`id_dep`
WHERE `tbl_user`.`id_dep` = 27
ORDER BY `tbl_audit_trail`.`created_at` DESC
 LIMIT 10