app/Models/Model_arsip.php

SELECT COALESCE(tbl_kategori.nama_kategori, "Tanpa Kategori") AS nama_kategori, COUNT(`tbl_arsip`.`id_arsip`) AS `total`
FROM `tbl_arsip`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_arsip`.`id_kategori`
WHERE `tbl_arsip`.`id_dep` = 27
GROUP BY `tbl_kategori`.`id_kategori`
ORDER BY `total` DESC
---
    public function getCountKategoriByDepId(int $depId): array
    {
        return $this->db->table($this->table)
            ->select('tbl_kategori.nama_kategori')
            ->selectCount($this->table . '.id_arsip', 'total')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = ' . $this->table . '.id_kategori', 'left')
            ->where($this->table . '.id_dep', $depId)
            ->groupBy('tbl_kategori.nama_kategori')
            ->get()
            ->getResultArray();

SELECT `tbl_arsip`.*, CASE 
            WHEN tbl_user.id_user IS NULL 
            THEN CONCAT(tbl_arsip.nama_user_upload, " (User Dihapus)") 
            ELSE tbl_user.nama_user 
        END as nama_user, `tbl_kategori`.`nama_kategori`, `tbl_dep`.`nama_dep`
FROM `tbl_arsip`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_arsip`.`id_user`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_arsip`.`id_kategori`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_arsip`.`id_dep`
ORDER BY `tbl_arsip`.`id_arsip` DESC
---
    public function getArsip()
    {
        return $this->db->table('tbl_arsip')
            ->select('tbl_arsip.*,
        CASE
            WHEN tbl_user.id_user IS NULL
            THEN CONCAT(tbl_arsip.nama_user_upload, " (User Dihapus)")
            ELSE tbl_user.nama_user
        END as nama_user,
        tbl_kategori.nama_kategori,
        tbl_dep.nama_dep')
            ->join('tbl_user', 'tbl_user.id_user = tbl_arsip.id_user', 'left')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_arsip.id_kategori', 'left')
            ->join('tbl_dep', 'tbl_dep.id_dep = tbl_arsip.id_dep', 'left')
            ->orderBy('tbl_arsip.id_arsip', 'DESC')
            ->get()
            ->getResultArray();

SELECT SUM(`ukuran_arsip`) AS `total_size_bytes`
FROM `tbl_arsip`
---
    public function getTotalSize(): int
    {
        $result = $this->db->table($this->table)
            ->selectSum('ukuran_arsip', 'total_size_bytes')
            ->get()
            ->getRow();

SELECT `tbl_kategori`.`nama_kategori`, COUNT(*) AS `total`
FROM `tbl_arsip`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_arsip`.`id_kategori`
GROUP BY `tbl_kategori`.`nama_kategori`
---
    public function getCountByKategori(): array
    {
        return $this->db->table($this->table)
            ->select('tbl_kategori.nama_kategori')
            ->selectCount('*', 'total')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_arsip.id_kategori', 'left')
            ->groupBy('tbl_kategori.nama_kategori')
            ->get()
            ->getResultArray();

SELECT `tbl_dep`.`nama_dep`, COALESCE(COUNT(tbl_arsip.id_arsip), 0) as total
FROM `tbl_dep`
LEFT JOIN `tbl_arsip` ON `tbl_dep`.`id_dep` = `tbl_arsip`.`id_dep`
GROUP BY `tbl_dep`.`id_dep`, `tbl_dep`.`nama_dep`
---
    public function getCountPerDepartment(): array
    {
        return $this->db->table('tbl_dep')
            ->select('tbl_dep.nama_dep, COALESCE(COUNT(tbl_arsip.id_arsip), 0) as total')
            ->join('tbl_arsip', 'tbl_dep.id_dep = tbl_arsip.id_dep', 'left')
            ->groupBy('tbl_dep.id_dep, tbl_dep.nama_dep')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tbl_arsip`
WHERE `id_dep` = 27
---
    public function countByDepartment(int $depId): int
    {
        return (int) $this->where('id_dep', $depId)->countAllResults();

SELECT `a`.*, `k`.`nama_kategori`, `d`.`nama_dep`, `u`.`nama_user`
FROM `tbl_arsip` `a`
LEFT JOIN `tbl_kategori` `k` ON `k`.`id_kategori` = `a`.`id_kategori`
LEFT JOIN `tbl_dep` `d` ON `d`.`id_dep` = `a`.`id_dep`
LEFT JOIN `tbl_user` `u` ON `u`.`id_user` = `a`.`id_user`
ORDER BY `a`.`id_arsip` DESC
SELECT `a`.*, `k`.`nama_kategori`, `d`.`nama_dep`, `u`.`nama_user`
FROM `tbl_arsip` `a`
LEFT JOIN `tbl_kategori` `k` ON `k`.`id_kategori` = `a`.`id_kategori`
LEFT JOIN `tbl_dep` `d` ON `d`.`id_dep` = `a`.`id_dep`
LEFT JOIN `tbl_user` `u` ON `u`.`id_user` = `a`.`id_user`
WHERE `a`.`id_dep` = 27
ORDER BY `a`.`id_arsip` DESC
---
    public function getArsipForUserWithAkses($id_dep, $id_user, $level)
    {
        $builder = $this->db->table('tbl_arsip a')
            ->select('a.*, k.nama_kategori, d.nama_dep, u.nama_user')
            ->join('tbl_kategori k', 'k.id_kategori = a.id_kategori', 'left')
            ->join('tbl_dep d', 'd.id_dep = a.id_dep', 'left')
            ->join('tbl_user u', 'u.id_user = a.id_user', 'left');

        if ($level == 0) {
            return $builder->orderBy('a.id_arsip', 'DESC')->get()->getResultArray();
        }

        if ($level == 1) {
            return $builder->where('a.id_dep', $id_dep)
                ->orderBy('a.id_arsip', 'DESC')
                ->get()
                ->getResultArray();