app/Models/Model_kategori.php

SELECT *
FROM `tbl_kategori`
WHERE `id_dep` = 27
---
    public function getByDep($id_dep)
    {
        return $this->where('id_dep', $id_dep)->findAll();

SELECT `tbl_kategori`.*, `tbl_dep`.`nama_dep`
FROM `tbl_kategori`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_kategori`.`id_dep`
---
    public function getKategoriWithDep()
    {
        return $this->db->table($this->table)
            ->select('tbl_kategori.*, tbl_dep.nama_dep')
            ->join('tbl_dep', 'tbl_dep.id_dep = tbl_kategori.id_dep', 'left')
            ->get()
            ->getResultArray();

SELECT `tbl_kategori`.*, `tbl_dep`.`nama_dep`
FROM `tbl_kategori`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_kategori`.`id_dep`
WHERE `tbl_kategori`.`id_dep` = '27'
---
    public function getKategoriTreeOptimized($id_dep = null)
    {
        $builder = $this->db->table($this->table)
            ->select('tbl_kategori.*, tbl_dep.nama_dep')
            ->join('tbl_dep', 'tbl_dep.id_dep = tbl_kategori.id_dep', 'left');

        if ($id_dep !== null) {
            $builder->where('tbl_kategori.id_dep', $id_dep);
        }

        $rows = $builder->get()->getResultArray();

SELECT `tbl_kategori`.*, `tbl_dep`.`nama_dep`, `parent`.`nama_kategori` as `parent_nama`
FROM `tbl_kategori`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_kategori`.`id_dep`
LEFT JOIN `tbl_kategori` as `parent` ON `parent`.`id_kategori` = `tbl_kategori`.`parent_id`
WHERE `tbl_kategori`.`id_dep` = '27'
---
    public function getKategoriWithParent($id_dep = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('tbl_kategori.*, tbl_dep.nama_dep, parent.nama_kategori as parent_nama');
        $builder->join('tbl_dep', 'tbl_dep.id_dep = tbl_kategori.id_dep', 'left');
        $builder->join('tbl_kategori as parent', 'parent.id_kategori = tbl_kategori.parent_id', 'left');

        if ($id_dep !== null) {
            $builder->where('tbl_kategori.id_dep', $id_dep);
        }

        return $builder->get()->getResultArray();