app/Models/Model_user.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
WHERE `id_dep` = 27
---
    public function countByDepartment(int $depId): int
    {
        return (int) $this->where('id_dep', $depId)->countAllResults();