app/Models/Model_bantuan.php

SELECT *
FROM `tbl_user`
WHERE `level` = 1
---
    public function listAdmin()
    {
        return $this->db->table('tbl_user')
            ->where('level', 1)
            ->get()->getResultArray();

SELECT *
FROM `tbl_user`
WHERE `level` = 0
---
    public function getSuperadminID()
    {
        return $this->db->table('tbl_user')
            ->where('level', 0)
            ->get()
            ->getRow('id_user');

SELECT *
FROM `pesan_bantuan`
WHERE   (
`id_pengirim` = '18'
AND `id_penerima` = '42'
 )
OR   (
`id_pengirim` = '42'
AND `id_penerima` = '18'
 )
ORDER BY `created_at` ASC
---
    public function listPercakapanByUser($idLogin, $idTarget)
    {
        return $this->db->table('pesan_bantuan')
            ->groupStart()
                ->where('id_pengirim', $idLogin)
                ->where('id_penerima', $idTarget)
            ->groupEnd()
            ->orGroupStart()
                ->where('id_pengirim', $idTarget)
                ->where('id_penerima', $idLogin)
            ->groupEnd()
            ->orderBy('created_at', 'ASC')
            ->get()->getResultArray();