app/Views/layouts/v_header.php

SELECT COUNT(*) AS `numrows`
FROM `pesan_bantuan`
WHERE `status` = 'baru'
SELECT *
FROM `pesan_bantuan`
JOIN `tbl_user` ON `tbl_user`.`id_user` = `pesan_bantuan`.`id_pengirim`
ORDER BY `id_pesan` DESC
 LIMIT 5
---
                    $db = \Config\Database::connect();

                    // Hitung jumlah pesan baru
                    $jmlPesanBaru = $db->table('pesan_bantuan')
                        ->where('status', 'baru')
                        ->countAllResults();

                    // Ambil 5 pesan terbaru
                    $pesanBaru = $db->table('pesan_bantuan')
                        ->join('tbl_user', 'tbl_user.id_user = pesan_bantuan.id_pengirim')
                        ->orderBy('id_pesan', 'DESC')
                        ->limit(5)
                        ->get()
                        ->getResultArray();