app/Views/layouts/v_header.php

                    // Hitung jumlah pesan baru
                    $idUser = session()->get('id_user');

                    $jmlPesanBaru = $db->table('pesan_bantuan')
                        ->where('id_penerima', $idUser)
                        ->where('status', 'baru')
                        ->countAllResults();

                    // Ambil 5 pesan terbaru
                   $pesanBaru = $db->table('pesan_bantuan')
                        ->join('tbl_user', 'tbl_user.id_user = pesan_bantuan.id_pengirim')
                        ->where('pesan_bantuan.id_penerima', $idUser)
                        ->orderBy('id_pesan', 'DESC')
                        ->limit(5)
                        ->get()
                        ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `pesan_bantuan`
WHERE `id_penerima` = '18'
AND `status` = 'baru'
SELECT *
FROM `pesan_bantuan`
JOIN `tbl_user` ON `tbl_user`.`id_user` = `pesan_bantuan`.`id_pengirim`
WHERE `pesan_bantuan`.`id_penerima` = '18'
ORDER BY `id_pesan` DESC
 LIMIT 5